# Требуется вычислить, сколько раз встречается некоторое
# число X в массиве A[1..N]. Пользователь в первой строке вводит
# натуральное число N – количество элементов в массиве. В последующих
# строках записаны N целых чисел Ai. Последняя строка содержит число X

# 5
# 1 2 3 4 5
# 3
# -> 1

# lenList = int(input('Введите длину списка: '))
# myList = list(range(1, lenList + 1))
# print(myList)
# number = int(input('Введите число: '))
# counter = 0
# for i in range(len(myList)):
#     if myList[i] == number:
#         counter += 1
# print(counter)



# ----------------------------------------------------------------------------


# Требуется найти в массиве A[1..N] самый близкий по
# величине элемент к заданному числу X. Пользователь в первой строке
# вводит натуральное число N – количество элементов в массиве. В
# последующих строках записаны N целых чисел A[i]. Последняя строка содержит число X

# 5
# 1 2 3 4 5
# 6
# -> 5

# lenList = int(input('Введите длину списка: '))
# myList = list(range(1, lenList + 1))
# print(myList)
# number = int(input('Введите число: '))
# for i in myList:
#     if i == number:
#         print(number)
#     elif myList[0] > number:
#         print(myList[0])
#         break
#     elif myList[lenList-1] < number:
#         print(myList[lenList-1])
#         break



# ----------------------------------------------------------------------------



# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную
# ценность. В случае с английским алфавитом очки распределяются так:
#  A, E, I, O, U, L, N, S, T, R – 1 очко;
#  D, G – 2 очка;
#  B, C, M, P – 3 очка;
#  F, H, V, W, Y – 4 очка;
#  K – 5 очков;
#  J, X – 8 очков;
#  Q, Z – 10 очков.

# А русские буквы оцениваются так:
#  А, В, Е, И, Н, О, Р, С, Т – 1 очко;
#  Д, К, Л, М, П, У – 2 очка;
#  Б, Г, Ё, Ь, Я – 3 очка;
#  Й, Ы – 4 очка;
#  Ж, З, Х, Ц, Ч – 5 очков;
#  Ш, Э, Ю – 8 очков;
#  Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово, которое содержит либо только
# английские, либо только русские буквы.




не смог ничего сделать :(